---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ExtendToOtherWarn
source: html/d5253a85-4cfa-a7b5-8870-73e7e6d5e91f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ExtendToOtherWarn Property

Can't keep [Type Name] extended to [Type Name].

## Syntax (C#)
```csharp
public static FailureDefinitionId ExtendToOtherWarn { get; }
```